test-results/k6-report-20vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 45s max duration (incl. graceful stop):
              * default: 20 looping VUs for 15s (gracefulStop: 30s)


running (00.9s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  00.9s/15s

running (01.9s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  01.9s/15s

running (02.9s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  02.9s/15s

running (03.9s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  03.9s/15s

running (04.9s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  04.9s/15s

running (05.9s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  05.9s/15s

running (06.9s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  06.9s/15s

running (07.9s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  07.9s/15s

running (08.9s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  08.9s/15s

running (09.9s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  09.9s/15s

running (10.9s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  10.9s/15s

running (11.9s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  11.9s/15s

running (12.9s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  12.9s/15s

running (13.9s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  13.9s/15s

running (14.9s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  14.9s/15s

running (15.8s), 00/20 VUs, 260 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  15s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=200.61ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 520     32.811237/s
    checks_succeeded...: 100.00% 520 out of 520
    checks_failed......: 0.00%   0 out of 520

    ✓ status is 200
    ✓ POST /user status 201

    HTTP
    http_req_duration..............: avg=102.51ms min=1.34ms med=11.9ms max=2.12s p(90)=54.88ms p(95)=200.61ms
      { expected_response:true }...: avg=102.51ms min=1.34ms med=11.9ms max=2.12s p(90)=54.88ms p(95)=200.61ms
    http_req_failed................: 0.00%  0 out of 520
    http_reqs......................: 520    32.811237/s

    EXECUTION
    iteration_duration.............: avg=1.21s    min=1s     med=1.02s  max=3.39s p(90)=1.09s   p(95)=3.34s   
    iterations.....................: 260    16.405619/s
    vus............................: 20     min=20       max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 268 kB 17 kB/s
    data_sent......................: 74 kB  4.7 kB/s



running (15.8s), 00/20 VUs, 260 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  15s