test-results/k6-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 45s max duration (incl. graceful stop):
              * default: 20 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  01.0s/15s

running (02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  02.0s/15s

running (03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  03.0s/15s

running (04.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  04.0s/15s

running (05.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  05.0s/15s

running (06.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  06.0s/15s

running (07.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  07.0s/15s

running (08.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  08.0s/15s

running (09.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  09.0s/15s

running (10.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  10.0s/15s

running (11.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  11.0s/15s

running (12.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  12.0s/15s

running (13.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  13.0s/15s

running (14.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  14.0s/15s

running (15.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  15.0s/15s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=41.4ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 600     38.38519/s
    checks_succeeded...: 100.00% 600 out of 600
    checks_failed......: 0.00%   0 out of 600

    ✓ status is 200
    ✓ POST /user status 201

    HTTP
    http_req_duration..............: avg=19.35ms min=930.8µs med=7.37ms max=315.56ms p(90)=21.51ms p(95)=41.4ms
      { expected_response:true }...: avg=19.35ms min=930.8µs med=7.37ms max=315.56ms p(90)=21.51ms p(95)=41.4ms
    http_req_failed................: 0.00%  0 out of 600
    http_reqs......................: 600    38.38519/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1s      med=1.01s  max=1.37s    p(90)=1.03s   p(95)=1.35s 
    iterations.....................: 300    19.192595/s
    vus............................: 20     min=20       max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 316 kB 20 kB/s
    data_sent......................: 85 kB  5.4 kB/s



running (15.6s), 00/20 VUs, 300 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  15s